{
    "recipes": [
      {
        "name": "Eclair Cake",
        "family": "Rust",
        "preparationTime": 20,        
        "dishType": "Dessert",
        "ingredients": "1 box honey graham crackers, 2 boxes French vanilla instant pudding, 1 8ox Cool Whip (thawed), 1 cup chocolate chips, 4 Tbsp. Light Karo Syrup, 4 Tbsp. Butter, 4 Tbsp. milk, 3 cups milk",
        "instructions": "Mix 3 cups of milk and 2 boxes of pudding in a mixing bowl. In a 13x9 pan layer graham crackers, half of pudding mixture. Repeat layering. End with graham crackers on top. Melt butter, Karo syurp, and chocolate chips in a pan and stir constantly. Pour chocolate mix on top of dish and spread evenly. Refrigerate for 8 hours. ",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/eclair-cake.jpg",
        "imageCredit": "Photo by www.bigoven.com"
      },
      {
        "name": "Broccoli Casserole",
        "family": "Rust",
        "preparationTime": 45,        
        "dishType": "Side Dish",
        "ingredients": "2 packages of 2lb. chopped broccoli, 1 can chedder cheese soup, 2 cups of shredded mozzarella cheese, 1 cup mayonnaise, 2 eggs beaten, Bred crumbs or croutons",
        "instructions": "Cook broccoli in boiling water and drain. Mix broccoli, chedar cheese soup, 1 cup of shredded mozzarella cheese, mayonaise, and eggs. Put mixture into a greased baking dish. Sprinkle remaining mozzarella cheese and bread crumbs on top. Bake at 350 degrees for 25 minutes.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/broccoli-casserole.jpg",
        "imageCredit": "Photo by yellowblissroad.com"
      },
      {
        "name": "Pulled Pork",
        "family": "Rust",
        "preparationTime": 10,        
        "dishType": "Main Dish",
        "ingredients": "Pork Tenderloin, Weber Dry Rub seasoning, Sweet Baby Ray's Original Barbecue Sauce ",
        "instructions": "Rub Weber Dry Rub into pork tenerloin and place tenderloin in a crock pot. Cover Tenderloin with barbecue sauce. Cook on low for 4-6 hours or until tender. Shred pork and serve.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/pulled-pork.jpg",
        "imageCredit": "Photo by delish.com"
      },
      {
        "name": "Baked Macaroni and Cheese",
        "family": "Palmatary",
        "preparationTime": 45,        
        "dishType": "Side Dish",
        "ingredients": "1 box macaroni noodles or cut Ziti, 6 tsp. margarine, 4 tsp. flour, 1 tsp. salt, dash of salt, 1 1/2 lbs. of grated American cheese, 4 cups milk",
        "instructions": "Cook macaroni until tender and drain. In saucepan melt butter blend in flour, salt, and pepper. Add milk; stir constantly until thick, add cheese. Stir until melted. Leave enough cheese for topping. Pour cheese sauce over cooked macaroni in 13x9 glass dish sprayed with Pam. Sprinkle remaining grated cheese over macaroni then pour Italian bread crumbs to cover. Bake at 350 degrees for 20 minutes.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/baked-mac-cheese.jpg",
        "imageCredit": "Photo by Duane Rust"
      },
      {
        "name": "Twice Baked Potatoes",
        "family": "Phillips",
        "preparationTime": 60,        
        "dishType": "Side Dish",
        "ingredients": "5 lb. bag potatoes, 1 package cream cheese-softened, 1 container sour cream, 1 stick butter, 1 8oz. bag of shredded cheddar cheese, Salt and pepper to taste",
        "instructions": "Preheat oven to 350 degrees. Peel, cut, and cook potatoes until tender then drain. Put hot potatoes in mixer. Add butter and small amount of milk to potatoes and mix together. Add salt and pepper to taste. Add cream cheese and sour cream until combined. Transfer potatoes to casserole dish. Top with shredded cheese. Bake at 350 degrees until bubbly and cooked through.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/baked-potatoes.jpg",
        "imageCredit": "Photo by recipegirl.com"
      },
      {
        "name": "Creamy Mac & Cheese- Instant Pot",
        "family": "Haddaway",
        "preparationTime": 25,        
        "dishType": "Side Dish",
        "ingredients": "1 lb. uncooked macaroni, 3 Tbsp. butter, 1 Tsp. yellow mustard, 1 Tbsp. kosher salt, 1/4 Tsp. pepper, 4 cups water, 1 12 oz. can evaporated milk, 16oz. extra sharp cheddar cheese",
        "instructions": "Add macaroni, butter, mustard, salt & pepper, and water to the Intant Pot. Stir & secure the lid. Select manual & cook at high pressure for 4 minutes. Once cooking is complete release steam. Select Saute and stir in evaporated milk and cheese until it has an even consistency.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/instant-pot-mac-cheese.jpg",
        "imageCredit": "Photo by cookfasteatwell.com"
      },
      {
        "name": "Squash Casserole",
        "family": "Haddaway",
        "preparationTime": 35,        
        "dishType": "Side Dish",
        "ingredients": "2 cans of squash & vidalia onions, 1/4 Tsp. salt & pepper, 1/4 cup melted butter, 1 egg, 2/3 cup of mayonnaise, 3 Tsp. sugar, 2 cups of cheese, breadcrumbs",
        "instructions": "Preheat oven to 350 degrees. In a mixing bowl, mix butter, egg, mayo, 1 cup cheese, and sugar. Place squash and onion in bean pot. Add mixture from mixing bowl on top of squash and gently toss together. Top with remaining chese. Cover with breadcrumbs. Bake at 350 degrees for 30 minutes.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/squash-casserole.jpg",
        "imageCredit": "Photo by sittinonasunflower.wordpress.com"
      },
      {
        "name": "Layered Salad",
        "family": "Cecils",
        "preparationTime": 20,        
        "dishType": "Side Dish",
        "ingredients": "8 cusp chopped iceburg lettuce, 2 cups frozen peas, 3/4 cup sliced red onions, 6 oz. chopped ham, 3/4 cup mayonnaise, 1/4 cup grated parmesan cheese, 1 Tbsp. sugar, 1 cup shredded cheese, 2/3 cup chopped tomatoes",
        "instructions": "Layer lettuce, peas, onions, and ham in a large straight sided serving bowl. Mix mayonnaise, parmesan cheese and sugar. Spread over salad to seal. Refrigerate for 8 hours. Top with chees and tomatoes before serving.",
        "imageSource": "https://cmst488-drust2.azurewebsites.net/Project4/images/layered-salad.jpg",
        "imageCredit": "Photo by myfoodandfamily.com"
      }

    ]
  }
  
